tap "buo/cask-upgrade"
tap "flagship-io/flagship"
tap "fsouza/prettierd"
tap "hashicorp/tap"
tap "he3-app/he3"
tap "heroku/brew"
tap "homebrew/autoupdate"
tap "homebrew/command-not-found"
tap "lencx/chatgpt", "https://github.com/lencx/ChatGPT.git"
tap "lencx/nofwl"
tap "oven-sh/bun"
tap "romkatv/powerlevel10k"
tap "stripe/stripe-cli"
tap "teamookla/speedtest"
tap "updatecli/updatecli"
brew "aalib"
brew "openjdk"
brew "ant"
brew "grpc"
brew "apache-arrow"
brew "ascii"
brew "atuin"
brew "autoconf"
brew "autodiff"
brew "autoenv"
brew "autojump"
brew "automake"
brew "b2-tools"
brew "bat"
brew "bison"
brew "bmon"
brew "boxes"
brew "bpython"
brew "btop"
brew "cabextract"
brew "coreutils"
brew "cask"
brew "cdrtools"
brew "gcc"
brew "certbot"
brew "chezmoi"
brew "chkrootkit"
brew "sdl2"
brew "ffmpeg"
brew "clitest"
brew "cloudflared"
brew "cmake"
brew "cmake-docs"
brew "cmatrix"
brew "cowsay"
brew "ctop"
brew "curl"
brew "deno"
brew "direnv"
brew "docker-compose"
brew "duti"
brew "libtool"
brew "erlang"
brew "elixir"
brew "eza"
brew "fastfetch"
brew "fdupes"
brew "figlet"
brew "file-formula"
brew "findutils"
brew "fnm"
brew "fontforge"
brew "fortune"
brew "fping"
brew "freetds"
brew "frum"
brew "fswatch"
brew "fzf"
brew "gnupg"
brew "libxml2"
brew "gdbm"
brew "gh"
brew "ghc"
brew "git"
brew "git-gui"
brew "gitbucket"
brew "global"
brew "gnu-tar"
brew "gnupg@2.2"
brew "go"
brew "gradle"
brew "openjdk@17"
brew "grails"
brew "grc"
brew "grep"
brew "groovy"
brew "smartmontools"
brew "gsmartcontrol"
brew "libpsl"
brew "halp"
brew "helix"
brew "hexedit"
brew "htop"
brew "httpie"
brew "httpx"
brew "hub"
brew "hugo"
brew "imagemagick"
brew "iperf"
brew "ipython"
brew "jnettop"
brew "joe"
brew "jq"
brew "kotlin"
brew "lazydocker"
brew "lazygit"
brew "libiconv"
brew "libvirt"
brew "libxslt"
brew "lima"
brew "links"
brew "python@3.12"
brew "llvm@16"
brew "lux"
brew "mackup"
brew "make"
brew "mas"
brew "memtester"
brew "meson"
brew "micro"
brew "midnight-commander"
brew "mingw-w64"
brew "molten-vk"
brew "moreutils"
brew "mpd"
brew "mtr"
brew "mutt"
brew "zlib"
brew "mysql"
brew "naabu"
brew "ncmpcpp"
brew "ne"
brew "neovim"
brew "nginx"
brew "ngspice"
brew "ninvaders"
brew "nmap"
brew "node", link: false
brew "nvm"
brew "ocaml"
brew "openapi-generator"
brew "opencv"
brew "openjdk@21"
brew "openssh"
brew "openssl@3.0"
brew "openvpn"
brew "osslsigncode"
brew "ox"
brew "pandoc"
brew "pdfcrack"
brew "php"
brew "plantuml"
brew "pnpm"
brew "postgis"
brew "postgresql@14", restart_service: :changed
brew "powerlevel10k"
brew "proxychains-ng"
brew "pssh"
brew "pv"
brew "pyenv"
brew "pyflow"
brew "python@3.11"
brew "python-gdbm@3.11"
brew "python-tk@3.11"
brew "qemu"
brew "qpdf"
brew "rcm"
brew "reattach-to-user-namespace"
brew "rlwrap"
brew "ruby"
brew "rust"
brew "rustup"
brew "screen"
brew "screenfetch"
brew "sdl2_image"
brew "sdl2_mixer"
brew "sdl2_ttf"
brew "shellcheck"
brew "shfmt"
brew "sl"
brew "slurm"
brew "spaceman-diff"
brew "spark"
brew "spice-gtk"
brew "src"
brew "stow"
brew "subversion"
brew "sugarjar"
brew "systemc"
brew "tailwindcss"
brew "tal"
brew "tcl-tk"
brew "tea"
brew "telnet"
brew "texinfo"
brew "thefuck"
brew "tig"
brew "tldr"
brew "tmux"
brew "toilet"
brew "tomcat"
brew "tor"
brew "tree"
brew "unzip"
brew "uv"
brew "vim"
brew "vips"
brew "watch"
brew "weechat"
brew "wget"
brew "wimlib"
brew "wireguard-tools"
brew "wireshark"
brew "wolfssl"
brew "yarn", link: false
brew "ykpers"
brew "yt-dlp"
brew "yubikey-agent"
brew "z"
brew "zip"
brew "zola"
brew "zoxide"
brew "zsh"
brew "zsh-completions"
brew "zshdb"
brew "zzz"
brew "oven-sh/bun/bun"
brew "stripe/stripe-cli/stripe"
brew "updatecli/updatecli/updatecli"
cask "1password"
cask "1password-cli"
cask "airtable", args: { appdir: "/Applications" }
cask "arc"
cask "brave-browser"
cask "caprine"
cask "chatgpt"
cask "cheatsheet"
cask "cursor"
cask "docker"
cask "dropbox"
cask "floorp"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-ia-writer-duo"
cask "font-ia-writer-mono"
cask "font-ia-writer-quattro"
cask "font-im-writing-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monofur-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-symbols-only-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-ubuntu-nerd-font"
cask "fontforge"
cask "gpg-suite"
cask "iina"
cask "imazing"
cask "libreoffice"
cask "macfuse"
cask "multipass"
cask "notion"
cask "onyx"
cask "opera"
cask "opera-gx"
cask "oracle-jdk"
cask "qbittorrent"
cask "qflipper"
cask "rar"
cask "signal"
cask "stats"
cask "telegram"
cask "thunderbird"
cask "transmission"
cask "virtualbox"
cask "vivaldi"
cask "vlc"
cask "warp"
cask "wifiman"
cask "xdm"
cask "zoom"
mas "CARROT Weather", id: 993487541
mas "Copilot", id: 1447330651
mas "DaVinci Resolve", id: 571213070
mas "FFmpeg Command Generator", id: 6444012595
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Timepage", id: 989178902
vscode "aaron-bond.better-comments"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "hookyqr.beautify"
vscode "mkhl.shfmt"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.remote-explorer"
vscode "openai.chatgpt"
vscode "prisma.prisma"
vscode "rebornix.ruby"
vscode "redhat.vscode-yaml"
vscode "rvest.vs-code-prettier-eslint"
vscode "streetsidesoftware.code-spell-checker"
vscode "trunk.io"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "willluke.nextjs"
vscode "wingrunr21.vscode-ruby"
