# Taps
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"

# Shell
brew "zsh"
brew "bash"
brew "tmux"

# Version Control
brew "git"
brew "gh"

# Development Tools
brew "vim"
brew "node"
brew "python"
brew "pyenv"
brew "pnpm"
brew "fzf"

# System Tools
brew "htop"
brew "tree"
brew "wget"
brew "curl"
brew "ripgrep"
brew "fd"

# Fonts
cask "font-fira-code"
cask "font-jetbrains-mono"

# Applications
cask "visual-studio-code"
cask "iterm2"
