tap "alienator88/cask"
tap "buo/cask-upgrade"
tap "charmbracelet/tap"
tap "dotenv-org/brew"
tap "flagship-io/flagship"
tap "fsouza/prettierd"
tap "hashicorp/tap"
tap "he3-app/he3"
tap "heroku/brew"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/command-not-found"
tap "homebrew/services"
tap "lencx/chatgpt", "https://github.com/lencx/ChatGPT.git"
tap "lencx/nofwl"
tap "oven-sh/bun"
tap "romankurnovskii/awesome-brew"
tap "romkatv/powerlevel10k"
tap "shaka-project/shaka-lab"
tap "snyk/tap"
tap "stripe/stripe-cli"
tap "teamookla/speedtest"
tap "updatecli/updatecli"
brew "aalib"
brew "ca-certificates"
brew "freetype"
brew "python-packaging"
brew "cairo"
brew "jpeg-turbo"
brew "openjdk"
brew "ant"
brew "antidote"
brew "aws-c-common"
brew "aws-c-cal", link: false
brew "aws-c-io", link: false
brew "aws-sdk-cpp"
brew "grpc"
brew "llvm"
brew "apache-arrow"
brew "ascii"
brew "aspell"
brew "atuin"
brew "autoconf"
brew "autodiff"
brew "autoenv"
brew "autojump"
brew "automake"
brew "b2-tools"
brew "bash"
brew "bat"
brew "bison"
brew "bmon"
brew "boxes"
brew "bpython"
brew "btop"
brew "cabextract"
brew "coreutils"
brew "nettle"
brew "unbound", restart_service: :changed
brew "gnutls"
brew "cask"
brew "cdrtools"
brew "gcc"
brew "certbot"
brew "pkgconf"
brew "chkrootkit"
brew "sdl2"
brew "ffmpeg"
brew "chruby"
brew "clitest"
brew "cloudflared"
brew "cmake"
brew "cmake-docs"
brew "cmatrix"
brew "cowsay"
brew "ctop"
brew "curl"
brew "czkawka"
brew "deno"
brew "direnv"
brew "dmg2img"
brew "docker"
brew "docker-compose"
brew "docker-machine", restart_service: :changed
brew "doggo"
brew "dotdrop"
brew "dotnet"
brew "dtools"
brew "duti"
brew "libtool"
brew "erlang"
brew "elixir"
brew "eza"
brew "fastfetch"
brew "fclones"
brew "fd"
brew "fdupes"
brew "figlet"
brew "file-formula"
brew "findutils"
brew "fontforge"
brew "fortune"
brew "fping"
brew "freetds"
brew "fswatch"
brew "fzf"
brew "gnupg"
brew "libxml2"
brew "gdbm"
brew "gh"
brew "git"
brew "git-gui"
brew "glab"
brew "libyaml"
brew "ncurses"
brew "global"
brew "gnu-tar"
brew "go"
brew "gradle"
brew "openjdk@17"
brew "grails"
brew "grc"
brew "grep"
brew "groovy"
brew "smartmontools"
brew "gsmartcontrol"
brew "libpsl"
brew "node"
brew "gtop"
brew "halp"
brew "handbrake"
brew "helix"
brew "hexedit"
brew "htop"
brew "httpie"
brew "httpx"
brew "hub"
brew "hugo"
brew "iperf"
brew "javacc"
brew "jnettop"
brew "joe"
brew "jq"
brew "kotlin"
brew "lazydocker"
brew "lazygit"
brew "libiconv"
brew "libpcap"
brew "libvirt"
brew "libxslt"
brew "lima"
brew "links"
brew "lux"
brew "lynx"
brew "mackup"
brew "make"
brew "mas"
brew "masscan"
brew "memtester"
brew "meson"
brew "micro"
brew "midnight-commander"
brew "mingw-w64"
brew "usage"
brew "mise"
brew "modsurfer"
brew "molten-vk"
brew "moreutils"
brew "mpd"
brew "mtr"
brew "mutt"
brew "zlib"
brew "mysql"
brew "mysql@8.4"
brew "naabu"
brew "ncdu"
brew "ncmpcpp"
brew "ne"
brew "neovim"
brew "nginx"
brew "ngspice"
brew "ninvaders"
brew "nmap"
brew "nnn"
brew "node@18"
brew "nvm"
brew "ocaml"
brew "onefetch"
brew "openapi-generator"
brew "python@3.12"
brew "opencv"
brew "openjdk@21"
brew "openssh"
brew "openvpn"
brew "osslsigncode"
brew "ox"
brew "pandoc"
brew "pdfcrack"
brew "perl"
brew "php"
brew "plantuml"
brew "pnpm"
brew "podman"
brew "podman-tui"
brew "postgis"
brew "postgresql@14", restart_service: :changed
brew "powerlevel10k"
brew "proxychains-ng"
brew "pssh"
brew "putty"
brew "pv"
brew "pyenv"
brew "python@3.11"
brew "python-gdbm@3.11"
brew "python-tk@3.11"
brew "qemu"
brew "qpdf"
brew "qt@5"
brew "rbenv"
brew "rcm"
brew "reattach-to-user-namespace"
brew "rlwrap"
brew "rsync"
brew "ruby"
brew "rust"
brew "rustup"
brew "screen"
brew "screenfetch"
brew "sdl2_image"
brew "sdl2_mixer"
brew "sdl2_ttf"
brew "sevenzip"
brew "shellcheck"
brew "sherlock"
brew "shfmt"
brew "sl"
brew "slurm"
brew "sniffnet"
brew "spaceman-diff"
brew "spark"
brew "spice-gtk"
brew "src"
brew "stow"
brew "subversion"
brew "sugarjar"
brew "superfile"
brew "sysbench"
brew "systemc"
brew "tailscale"
brew "tailwindcss"
brew "tal"
brew "tcl-tk"
brew "tea"
brew "telnet"
brew "texinfo"
brew "thefuck"
brew "tig"
brew "tlrc"
brew "tmux"
brew "toilet"
brew "tomcat"
brew "tor"
brew "tree"
brew "unzip"
brew "vips"
brew "watch"
brew "weechat"
brew "wget"
brew "wifi-password"
brew "wimlib"
brew "wolfssl"
brew "wren"
brew "wtfutil"
brew "yarn"
brew "yazi"
brew "ykpers"
brew "yt-dlp"
brew "yubikey-agent"
brew "z"
brew "zim"
brew "zip"
brew "zola"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "zshdb"
brew "charmbracelet/tap/gum"
brew "oven-sh/bun/bun"
brew "updatecli/updatecli/updatecli"
cask "1password"
cask "1password-cli"
cask "applite"
cask "balenaetcher"
cask "brave-browser"
cask "brewmate"
cask "caprine"
cask "cork"
cask "deadbolt"
cask "devtoys"
cask "dropbox"
cask "fastdmg"
cask "floorp"
cask "fluent-reader"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-ia-writer-duo"
cask "font-ia-writer-mono"
cask "font-ia-writer-quattro"
cask "font-im-writing-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monofur-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-symbols-only-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-ubuntu-nerd-font"
cask "fontforge"
cask "freecad"
cask "ghostty"
cask "google-drive"
cask "gpg-suite"
cask "httpie"
cask "iina"
cask "imazing"
cask "insync"
cask "jami"
cask "jordanbaird-ice"
cask "keka"
cask "knockknock"
cask "launchpad-manager"
cask "libreoffice"
cask "loop"
cask "lulu"
cask "macfuse"
cask "moneymanager"
cask "multipass"
cask "nordvpn"
cask "notion"
cask "notion-calendar"
cask "obsidian"
cask "onyx"
cask "openoffice"
cask "openzfs"
cask "opera-gx"
cask "oracle-jdk"
cask "orbstack"
cask "orion"
cask "pieces"
cask "pieces-os"
cask "podman-desktop"
cask "powershell"
cask "private-internet-access"
cask "qbittorrent"
cask "qflipper"
cask "rar"
cask "sentinel-app"
cask "signal"
cask "sweet-home3d"
cask "tailscale"
cask "telegram"
cask "unetbootin"
cask "uvtools"
cask "virtualbox"
cask "vivaldi"
cask "warp"
cask "wezterm"
cask "wifiman"
cask "windsurf"
cask "wireshark"
cask "yandex-disk"
cask "yubico-yubikey-manager"
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "CARROT Weather", id: 993487541
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PDF Password Remover", id: 1608181200
mas "Super Agent", id: 1568262835
